tap "anomalyco/tap"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "tonisives/tap"
brew "bash"
brew "fd"
brew "fzf"
brew "git-crypt"
brew "gnupg"
brew "go"
brew "htop"
brew "k9s"
brew "lazygit"
brew "node"
brew "pkgconf"
brew "python@3.14"
brew "ripgrep"
brew "sd"
brew "sdl2"
brew "sdl2_gfx"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "xclip"
brew "anomalyco/tap/opencode"
brew "hashicorp/tap/terraform"
cask "nikitabobko/tap/aerospace"
cask "linearmouse"
cask "tonisives/tap/ovim"
